---
title: EditingFailures
classe: Autodesk.Revit.DB.BuiltInFailures+EditingFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 73
---

# EditingFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId AllInvisibleInPlanViewWarn { get; }` | `EditingFailures.AllInvisibleInPlanViewWarn` | FailureDefinitionId |
| `FailureDefinitionId AllInvisibleInViewWarn { get; }` | `EditingFailures.AllInvisibleInViewWarn` | FailureDefinitionId |
| `FailureDefinitionId BorrowElementsAtRisk { get; }` | `EditingFailures.BorrowElementsAtRisk` | FailureDefinitionId |
| `FailureDefinitionId CannotBorrowBusyContention { get; }` | `EditingFailures.CannotBorrowBusyContention` | FailureDefinitionId |
| `FailureDefinitionId CannotCheckoutWorksets { get; }` | `EditingFailures.CannotCheckoutWorksets` | FailureDefinitionId |
| `FailureDefinitionId CannotDeleteEditedElement { get; }` | `EditingFailures.CannotDeleteEditedElement` | FailureDefinitionId |
| `FailureDefinitionId CannotDeleteEditedElementError { get; }` | `EditingFailures.CannotDeleteEditedElementError` | FailureDefinitionId |
| `FailureDefinitionId CannotDeletePredefinedFamilyElement { get; }` | `EditingFailures.CannotDeletePredefinedFamilyElement` | FailureDefinitionId |
| `FailureDefinitionId CannotDrawInCurrentView { get; }` | `EditingFailures.CannotDrawInCurrentView` | FailureDefinitionId |
| `FailureDefinitionId CannotDuplicateType { get; }` | `EditingFailures.CannotDuplicateType` | FailureDefinitionId |
| `FailureDefinitionId CannotEditDeletedElements { get; }` | `EditingFailures.CannotEditDeletedElements` | FailureDefinitionId |
| `FailureDefinitionId CannotEditDeletedWorkset { get; }` | `EditingFailures.CannotEditDeletedWorkset` | FailureDefinitionId |
| `FailureDefinitionId CannotEditEditingElements { get; }` | `EditingFailures.CannotEditEditingElements` | FailureDefinitionId |
| `FailureDefinitionId CannotEditElements { get; }` | `EditingFailures.CannotEditElements` | FailureDefinitionId |
| `FailureDefinitionId CannotEditRenamedWorkset { get; }` | `EditingFailures.CannotEditRenamedWorkset` | FailureDefinitionId |
| `FailureDefinitionId CannotMirrorInView { get; }` | `EditingFailures.CannotMirrorInView` | FailureDefinitionId |
| `FailureDefinitionId CannotMoveElement { get; }` | `EditingFailures.CannotMoveElement` | FailureDefinitionId |
| `FailureDefinitionId CannotMoveElementWarn { get; }` | `EditingFailures.CannotMoveElementWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotMoveElementWithoutWorkplane { get; }` | `EditingFailures.CannotMoveElementWithoutWorkplane` | FailureDefinitionId |
| `FailureDefinitionId CannotMoveHereInViewError { get; }` | `EditingFailures.CannotMoveHereInViewError` | FailureDefinitionId |
| `FailureDefinitionId CannotMoveInView { get; }` | `EditingFailures.CannotMoveInView` | FailureDefinitionId |
| `FailureDefinitionId CannotMoveInViewError { get; }` | `EditingFailures.CannotMoveInViewError` | FailureDefinitionId |
| `FailureDefinitionId CannotMoveLocked { get; }` | `EditingFailures.CannotMoveLocked` | FailureDefinitionId |
| `FailureDefinitionId CannotMoveTogether { get; }` | `EditingFailures.CannotMoveTogether` | FailureDefinitionId |
| `FailureDefinitionId CannotPickHereInCurrentView { get; }` | `EditingFailures.CannotPickHereInCurrentView` | FailureDefinitionId |
| `FailureDefinitionId CannotRotateLocked { get; }` | `EditingFailures.CannotRotateLocked` | FailureDefinitionId |
| `FailureDefinitionId CannotScaleInView { get; }` | `EditingFailures.CannotScaleInView` | FailureDefinitionId |
| `FailureDefinitionId DeletedRequestedWarn { get; }` | `EditingFailures.DeletedRequestedWarn` | FailureDefinitionId |
| `FailureDefinitionId DeleteElementsError { get; }` | `EditingFailures.DeleteElementsError` | FailureDefinitionId |
| `FailureDefinitionId DeleteElementsWarn { get; }` | `EditingFailures.DeleteElementsWarn` | FailureDefinitionId |
| `FailureDefinitionId DeletePreventedByGroup { get; }` | `EditingFailures.DeletePreventedByGroup` | FailureDefinitionId |
| `FailureDefinitionId ElementNotEditable { get; }` | `EditingFailures.ElementNotEditable` | FailureDefinitionId |
| `FailureDefinitionId ElementReversed { get; }` | `EditingFailures.ElementReversed` | FailureDefinitionId |
| `FailureDefinitionId ElementsDeleted { get; }` | `EditingFailures.ElementsDeleted` | FailureDefinitionId |
| `FailureDefinitionId ElementsDeletedPastedToKeep { get; }` | `EditingFailures.ElementsDeletedPastedToKeep` | FailureDefinitionId |
| `FailureDefinitionId ElementsNotInPlane { get; }` | `EditingFailures.ElementsNotInPlane` | FailureDefinitionId |
| `FailureDefinitionId ElementsWillBeDeleted { get; }` | `EditingFailures.ElementsWillBeDeleted` | FailureDefinitionId |
| `FailureDefinitionId ExtendToOtherCrash { get; }` | `EditingFailures.ExtendToOtherCrash` | FailureDefinitionId |
| `FailureDefinitionId ExtendToOthersWarn { get; }` | `EditingFailures.ExtendToOthersWarn` | FailureDefinitionId |
| `FailureDefinitionId ExtendToOtherWarn { get; }` | `EditingFailures.ExtendToOtherWarn` | FailureDefinitionId |
| `FailureDefinitionId GeneratedByMassing { get; }` | `EditingFailures.GeneratedByMassing` | FailureDefinitionId |
| `FailureDefinitionId HaveNoPermissionToEdit { get; }` | `EditingFailures.HaveNoPermissionToEdit` | FailureDefinitionId |
| `FailureDefinitionId HiddenBeamsEditingWarning { get; }` | `EditingFailures.HiddenBeamsEditingWarning` | FailureDefinitionId |
| `FailureDefinitionId InvalidArrayObject { get; }` | `EditingFailures.InvalidArrayObject` | FailureDefinitionId |
| `FailureDefinitionId InvalidElemsInSelection { get; }` | `EditingFailures.InvalidElemsInSelection` | FailureDefinitionId |
| `FailureDefinitionId LockedDeleted { get; }` | `EditingFailures.LockedDeleted` | FailureDefinitionId |
| `FailureDefinitionId LockedDeletedWarn { get; }` | `EditingFailures.LockedDeletedWarn` | FailureDefinitionId |
| `FailureDefinitionId MirrorProjectSuccess { get; }` | `EditingFailures.MirrorProjectSuccess` | FailureDefinitionId |
| `FailureDefinitionId NElementsDeleted { get; }` | `EditingFailures.NElementsDeleted` | FailureDefinitionId |
| `FailureDefinitionId NElementsWrongPosition { get; }` | `EditingFailures.NElementsWrongPosition` | FailureDefinitionId |
| `FailureDefinitionId NoRotateMirrorZ { get; }` | `EditingFailures.NoRotateMirrorZ` | FailureDefinitionId |
| `FailureDefinitionId NoRotateMirrorZError { get; }` | `EditingFailures.NoRotateMirrorZError` | FailureDefinitionId |
| `FailureDefinitionId OutOfDateElements { get; }` | `EditingFailures.OutOfDateElements` | FailureDefinitionId |
| `FailureDefinitionId OwnedByOther { get; }` | `EditingFailures.OwnedByOther` | FailureDefinitionId |
| `FailureDefinitionId OwnElementsOutOfDate { get; }` | `EditingFailures.OwnElementsOutOfDate` | FailureDefinitionId |
| `FailureDefinitionId PinnedObjectHostDeleted { get; }` | `EditingFailures.PinnedObjectHostDeleted` | FailureDefinitionId |
| `FailureDefinitionId PinnedObjectNotDeleted { get; }` | `EditingFailures.PinnedObjectNotDeleted` | FailureDefinitionId |
| `FailureDefinitionId PinnedObjectSomeDeleted { get; }` | `EditingFailures.PinnedObjectSomeDeleted` | FailureDefinitionId |
| `FailureDefinitionId PlacementFailed { get; }` | `EditingFailures.PlacementFailed` | FailureDefinitionId |
| `FailureDefinitionId PressShowToSee { get; }` | `EditingFailures.PressShowToSee` | FailureDefinitionId |
| `FailureDefinitionId ReloadBeforeMakeEditable { get; }` | `EditingFailures.ReloadBeforeMakeEditable` | FailureDefinitionId |
| `FailureDefinitionId ReloadNoGood { get; }` | `EditingFailures.ReloadNoGood` | FailureDefinitionId |
| `FailureDefinitionId RPCTurnOffInRealisticWarn { get; }` | `EditingFailures.RPCTurnOffInRealisticWarn` | FailureDefinitionId |
| `FailureDefinitionId SourceInEditMode { get; }` | `EditingFailures.SourceInEditMode` | FailureDefinitionId |
| `FailureDefinitionId TargetInEditMode { get; }` | `EditingFailures.TargetInEditMode` | FailureDefinitionId |
| `FailureDefinitionId TemporaryChangesOutOfDate { get; }` | `EditingFailures.TemporaryChangesOutOfDate` | FailureDefinitionId |
| `FailureDefinitionId TemporaryChangesTransparentPermissions { get; }` | `EditingFailures.TemporaryChangesTransparentPermissions` | FailureDefinitionId |
| `FailureDefinitionId TooManyElementsToCheckout { get; }` | `EditingFailures.TooManyElementsToCheckout` | FailureDefinitionId |
| `FailureDefinitionId UnableFilletSpecifiedRadius { get; }` | `EditingFailures.UnableFilletSpecifiedRadius` | FailureDefinitionId |
| `FailureDefinitionId UnableToMakeSourceWorksetEditable { get; }` | `EditingFailures.UnableToMakeSourceWorksetEditable` | FailureDefinitionId |
| `FailureDefinitionId UnableToTransformElement { get; }` | `EditingFailures.UnableToTransformElement` | FailureDefinitionId |
| `FailureDefinitionId UnableToTransformElementError { get; }` | `EditingFailures.UnableToTransformElementError` | FailureDefinitionId |
| `FailureDefinitionId WorksetHasChangedInCentralFile { get; }` | `EditingFailures.WorksetHasChangedInCentralFile` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```